# ComboBoxDropDownClosedEventArgs Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComboBoxDropDownClosedEventArgs Constructor
ComboBoxDropDownClosedEventArgs Class See Also
---
Initializes a new instance of the ComboBoxDropDownClosedEventArgs class
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ComboBoxDropDownClosedEventArgs()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ComboBoxDropDownClosedEventArgs()
```

# See Also
ComboBoxDropDownClosedEventArgs Class
Autodesk.Revit.UI.Events Namespace